init.org
#+STARTUP: overview
#+TODO: TODO DISABLED | ENABLED
#+PROPERTY: header-args:emacs-lisp :tangle yes
* A. Elisp utilities
This function is called by the save hook on init.org to trigger automatically a tangling

#+BEGIN_SRC emacs-lisp
;; Utilities functions

(defun my/tangle-init ()
  "Tangle an init file while ignoring DISABLED headers and :tangle nil"
  (let ((body-list ()) (output-file "~/.emacs.d/init.el"))
    (org-babel-map-src-blocks "~/.emacs.d/init.org"
      (add-to-list 'body-list (unless (string= (org-get-todo-state) "DISABLED") body)))
    (with-temp-file output-file
    (insert (apply 'concat (reverse body-list)))
    (message (format "Wrote %d code blocks to init.el" (length body-list))))))

#+END_SRC
* B. Security fixes
#+BEGIN_SRC emacs-lisp
  (eval-after-load "enriched"
    '(defun enriched-decode-display-prop (start end &optional param)
       (list start end)))
#+END_SRC
* 1. Package management & installations
Regroupment of the package manager

#+BEGIN_SRC emacs-lisp
;; Initialize packages to install use-package
(require 'package)
(setq package-enable-at-startup nil)

#+END_SRC
** Melpa
We add melpa to the package-archives

#+BEGIN_SRC emacs-lisp

(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))

#+END_SRC
** Vendor packages
Add the vendor directory for a source of .el files
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (concat user-emacs-directory "vendors/"))
#+END_SRC
** Org archives
We also enable org as an archive source
#+BEGIN_SRC emacs-lisp

(add-to-list 'package-archives
             '("org" . "http://orgmode.org/elpa/"))

#+END_SRC
** Initialize packages
Uncomment package-refresh-contents for faster startup,
but you will need to reactivate it every time you install
a new package

#+BEGIN_SRC emacs-lisp
(package-initialize)
;; (package-refresh-contents)
#+END_SRC
** Use-package
Installation and configuration of the use-package macro

[[https://github.com/jwiegley/use-package][Project homepage]]

#+BEGIN_SRC emacs-lisp
;; Install use-package only if it's not there
(unless (package-installed-p 'use-package)
   (package-refresh-contents)
   (package-install 'use-package))

(setq use-package-verbose t) ;; Show loaded packages in *messages*

#+END_SRC

* 2. Main extensions
Core extensions required by multiple packages and to load on startup
** Evil
Evil brings emacs closer to VIM by providing vim-like bindings globally
*** Installation of Evil
#+BEGIN_SRC emacs-lisp
;; Install evil only if it's not there
(unless (package-installed-p 'evil)
   (package-refresh-contents)
   (package-install 'evil))

#+END_SRC
*** Enabling evil globally
Core module so we enable it globally

#+BEGIN_SRC emacs-lisp
;; Enable evil globally
(require 'evil)
(evil-mode 1)

#+END_SRC
*** Unsetting some evil default commands
If we want to be able to use some nice vim overriding we need to
unbind them first.
#+BEGIN_SRC emacs-lisp
;; Unsetting some default evil commands, that I
;; plan to use
(require 'evil)
(evil-mode 1)

(define-key evil-motion-state-map (kbd "SPC") nil)
(define-key evil-motion-state-map "," nil)
(define-key evil-motion-state-map "zz" nil)
(define-key evil-motion-state-map "za" nil)
(define-key evil-normal-state-map (kbd "g,") nil)

#+END_SRC
*** Evil commentary
Evil commentary allows to comment lines for modes easily

[[https://github.com/linktohack/evil-commentary][Project homepage]]

#+BEGIN_SRC emacs-lisp
(use-package evil-commentary
    :ensure t
    :commands (evil-commentary))

#+END_SRC
*** Evil surround
Allow to easily surround a text object with another text object

[[https://github.com/timcharper/evil-surround][Project homepage]]

#+BEGIN_SRC emacs-lisp
(use-package evil-surround
  :ensure t
  :init
  (global-evil-surround-mode t))

#+END_SRC
*** Remap Y to y$ instead of yy
#+BEGIN_SRC emacs-lisp
(customize-set-variable 'evil-want-Y-yank-to-eol t)

#+END_SRC
***
***
***
***
***
** General
General is a replacement for traditional keybindings, for keychords
AND for evil leader. Damn useful if you ask me.

[[https://github.com/noctuid/general.el][Project homepage]]

*** Installation
Install general if not already there
#+BEGIN_SRC emacs-lisp
;; Install general only if it's not there
(unless (package-installed-p 'general)
   (package-refresh-contents)
   (package-install 'general))
(require 'general)

#+END_SRC

*** Configuration
#+BEGIN_SRC emacs-lisp
(setq general-default-keymaps 'evil-motion-state-map)
(setq default-leader-key "SPC")
(setq application-leader-key ",")
(setq general-default-non-normal-prefix "C-SPC")

#+END_SRC
** Keychord
Keychord is a useful macro to bind two rapid keystroke to a command.

[[https://www.emacswiki.org/emacs/KeyChord][Project homepage]]

*** Installation
Install only if not already installed

#+BEGIN_SRC emacs-lisp
;; Install keychord only if it's not there
(unless (package-installed-p 'key-chord)
   (package-refresh-contents)
   (package-install 'key-chord))
(require 'key-chord)

#+END_SRC

*** Configuration
Enable key-chord globally so we can easily easily espace insert mode

#+BEGIN_SRC emacs-lisp
(setq key-chord-two-keys-delay 0.1) ;; default 0.1
(setq key-chord-one-key-delay 0.2) ;; default 0.2

(key-chord-mode 1)
(key-chord-define evil-insert-state-map "jk" 'evil-normal-state)
(key-chord-define evil-insert-state-map "ht" 'evil-normal-state)
(key-chord-define evil-replace-state-map "ht" 'evil-normal-state)
(key-chord-define evil-replace-state-map "jk" 'evil-normal-state)

#+END_SRC
** Hydra
Hydra is used to create semi mode-state. It's mostly an utility. It is really useful
when trying to define your own "state" as a custom VIM "state"

[[https://github.com/abo-abo/hydra][Project homepage]]

*** Installation
#+BEGIN_SRC emacs-lisp
;; Install hydra only if it's not there
(unless (package-installed-p 'hydra)
   (package-refresh-contents)
   (package-install 'hydra))
(require 'hydra)
#+END_SRC
*** Disable hydra help
There is normally an helper when entering an hydra. The problem is since we
want to use a separate minibuffer, we need to disable it, as there is a
few bugs related to that

#+BEGIN_SRC emacs-lisp
;; Since we use the minibuffer in a separate frame. No help
;; for us
(setq hydra-is-helpful nil)

#+END_SRC
** Ivy
Ivy is a generic completion framework. We can use it to search, files, buffers, select items from
lists, etc...

[[http://github.com/abo-abo/swiper][Project homepage]]

*** Custom IVY hydra
Custom bindings for a custom hydra binding. It adds some functions to our IVY.
#+BEGIN_SRC emacs-lisp
(defun my/ivy-get-selection ()
    "Returns the selected ivy text"
    (expand-file-name ivy--current ivy--directory))

(defun my/ivy-append-yank ()
    "Append the current line to the current kill-ring (via a register"
    (interactive)
    (set-register 300 (concat (get-register 300) (my/ivy-get-selection) "\n")))

(defun my/ivy-override-yank ()
    "Override the latest kill-ring"
    (interactive)
    (kill-new (my/ivy-get-selection)))

(defun my/ivy-mark ()
    "Append the current line to the current kill-ring (via a register"
    (interactive)
    (set-register 400 (concat (get-register 400) ivy--current "\n")))

(defun my/ivy-mark-display-transformer (str)
    "Transform string -> string"
    (let ((reg (get-register 400)))
    (if (member str (when reg (split-string reg "\n")))
     (concat "* " str)
     str)))

#+END_SRC
*** Installtion & Configuration of Ivy
We configure and install ivy, which is the Engine
#+BEGIN_SRC emacs-lisp
(use-package ivy
  :ensure t
  :diminish ivy-mode
  :bind
  (:map ivy-minibuffer-map
    ("C-S-J" . ivy-scroll-down-command)
    ("C-j" . ivy-next-line)
    ("C-S-K" . ivy-scroll-up-command)
    ("C-k" . ivy-previous-line)
    ("C-l" . ivy-alt-done)
    ("<C-return>" . ivy-immediate-done)
    ("C-S-T" . ivy-scroll-down-command)
    ("C-t" . ivy-next-line)
    ("C-S-H" . ivy-scroll-up-command)
    ("C-h" . ivy-previous-line)
    ("C-s" . ivy-alt-done)
    ("<C-return>" . ivy-immediate-done)
    ("C-n" . ivy-backward-kill-word))
  :init
  (progn
    ;; Set default regex matching
    (setq ivy-re-builders-alist
          '((ivy-switch-buffer . ivy--regex-fuzzy)
            (counsel-find-file . ivy--regex-fuzzy)
            (t . ivy--regex-plus)))
    (setq ivy-wrap t)
    ;; Remove ../ and ./ from files selection t
    (setq ivy-extra-directories nil)
    (setq ivy-height 25)
    ;; Enable globally
    (ivy-mode 1))

  :config
  (progn
    ;; Define a custom hydra
    (key-chord-define ivy-minibuffer-map "jk"
                      (defhydra hydra-ivy/body
                                (:post (when
                                   (get-register 300)
                                   (kill-new (get-register 300))
                                   (set-register 300 nil)))
                                "ivy"
                                ("j" ivy-next-line "down")
                                ("k" ivy-previous-line "up")
                                ("l" ivy-alt-done "forward")
                                ("h" ivy-backward-kill-word "back")
                                ("y" my/ivy-append-yank "yank")
                                ("m" my/ivy-mark "mark")
                                ("Y" my/ivy-override-yank "override")
                                ("i" nil "insert")))
        (key-chord-define ivy-minibuffer-map "ht"
                      (defhydra hydra-ivy/body
                                (:post (when
                                   (get-register 300)
                                   (kill-new (get-register 300))
                                   (set-register 300 nil)))
                                "ivy"
                                ("j" ivy-next-line "up")
                                ("k" ivy-previous-line "down")
                                ("s" ivy-alt-done "forward")
                                ("n" ivy-backward-kill-word "back")
                                ("y" my/ivy-append-yank "yank")
                                ("m" my/ivy-mark "mark")
                                ("Y" my/ivy-override-yank "override")
                                ("i" nil "insert")))))

#+END_SRC

