init.el
;; Utilities functions

(defun my/tangle-init ()
  "Tangle an init file while ignoring DISABLED headers and :tangle nil"
  (let ((body-list ()) (output-file "~/.emacs.d/init.el"))
    (org-babel-map-src-blocks "~/.emacs.d/init.org"
      (add-to-list 'body-list (unless (string= (org-get-todo-state) "DISABLED") body)))
    (with-temp-file output-file
    (insert (apply 'concat (reverse body-list)))
    (message (format "Wrote %d code blocks to init.el" (length body-list))))))

  (eval-after-load "enriched"
    '(defun enriched-decode-display-prop (start end &optional param)
       (list start end)))
;; Initialize packages to install use-package
(require 'package)
(setq package-enable-at-startup nil)


(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))

(add-to-list 'load-path (concat user-emacs-directory "vendors/"))

(add-to-list 'package-archives
             '("org" . "http://orgmode.org/elpa/"))

(package-initialize)
;; (package-refresh-contents)
;; Install use-package only if it's not there
(unless (package-installed-p 'use-package)
   (package-refresh-contents)
   (package-install 'use-package))

(setq use-package-verbose t) ;; Show loaded packages in *messages*

;; Install evil only if it's not there
(unless (package-installed-p 'evil)
   (package-refresh-contents)
   (package-install 'evil))

;; Enable evil globally
(require 'evil)
(evil-mode 1)

;; Unsetting some default evil commands, that I
;; plan to use
(require 'evil)
(evil-mode 1)

(define-key evil-motion-state-map (kbd "SPC") nil)
(define-key evil-motion-state-map "," nil)
(define-key evil-motion-state-map "zz" nil)
(define-key evil-motion-state-map "za" nil)
(define-key evil-normal-state-map (kbd "g,") nil)

(use-package evil-commentary
    :ensure t
    :commands (evil-commentary))

(use-package evil-surround
  :ensure t
  :init
  (global-evil-surround-mode t))

(customize-set-variable 'evil-want-Y-yank-to-eol t)

;; Install general only if it's not there
(unless (package-installed-p 'general)
   (package-refresh-contents)
   (package-install 'general))
(require 'general)

(setq general-default-keymaps 'evil-motion-state-map)
(setq default-leader-key "SPC")
(setq application-leader-key ",")
(setq general-default-non-normal-prefix "C-SPC")

;; Install keychord only if it's not there
(unless (package-installed-p 'key-chord)
   (package-refresh-contents)
   (package-install 'key-chord))
(require 'key-chord)

(setq key-chord-two-keys-delay 0.1) ;; default 0.1
(setq key-chord-one-key-delay 0.2) ;; default 0.2

(key-chord-mode 1)
(key-chord-define evil-insert-state-map "jk" 'evil-normal-state)
(key-chord-define evil-replace-state-map "jk" 'evil-normal-state)

;; Install hydra only if it's not there
(unless (package-installed-p 'hydra)
   (package-refresh-contents)
   (package-install 'hydra))
(require 'hydra)
;; Since we use the minibuffer in a separate frame. No help
;; for us
(setq hydra-is-helpful nil)

(defun my/ivy-get-selection ()
    "Returns the selected ivy text"
    (expand-file-name ivy--current ivy--directory))

(defun my/ivy-append-yank ()
    "Append the current line to the current kill-ring (via a register"
    (interactive)
    (set-register 300 (concat (get-register 300) (my/ivy-get-selection) "\n")))

(defun my/ivy-override-yank ()
    "Override the latest kill-ring"
    (interactive)
    (kill-new (my/ivy-get-selection)))

(defun my/ivy-mark ()
    "Append the current line to the current kill-ring (via a register"
    (interactive)
    (set-register 400 (concat (get-register 400) ivy--current "\n")))

(defun my/ivy-mark-display-transformer (str)
    "Transform string -> string"
    (let ((reg (get-register 400)))
    (if (member str (when reg (split-string reg "\n")))
     (concat "* " str)
     str)))

(use-package ivy
  :ensure t
  :diminish ivy-mode
  :bind
  (:map ivy-minibuffer-map
    ("C-S-J" . ivy-scroll-down-command)
    ("C-j" . ivy-next-line)
    ("C-S-K" . ivy-scroll-up-command)
    ("C-k" . ivy-previous-line)
    ("C-l" . ivy-alt-done)
    ("<C-return>" . ivy-immediate-done)
    ("C-h" . ivy-backward-kill-word))
  :init
  (progn
    ;; Set default regex matching
    (setq ivy-re-builders-alist
          '((ivy-switch-buffer . ivy--regex-fuzzy)
            (counsel-find-file . ivy--regex-fuzzy)
            (t . ivy--regex-plus)))
    (setq ivy-wrap t)
    ;; Remove ../ and ./ from files selection t)
    (setq ivy-extra-directories nil)
    (setq ivy-height 25)
    ;; Enable globally
    (ivy-mode 1))

  :config
  (progn
    ;; Define a custom hydra
    (key-chord-define ivy-minibuffer-map "jk"
                      (defhydra hydra-ivy/body
                                (:post (when
                                   (get-register 300)
                                   (kill-new (get-register 300))
                                   (set-register 300 nil)))
                                "ivy"
                                ("j" ivy-next-line "down")
                                ("k" ivy-previous-line "up")
                                ("l" ivy-alt-done "forward")
                                ("h" ivy-backward-kill-word "back")
                                ("y" my/ivy-append-yank "yank")
                                ("m" my/ivy-mark "mark")
                                ("Y" my/ivy-override-yank "override")
                                ("i" nil "insert")))))

(use-package counsel
    :ensure t
