init.org
*** Installation and configuration of Counsel
We install and configure counsel, which uses ivy and provides some nice default funcions

#+BEGIN_SRC emacs-lisp
(use-package counsel
    :ensure t
    :commands (counsel-find-file locate-file counsel-describe-function ivy-switch-buffer swiper)
    :bind
    (("C-x C-f" . counsel-find-file)
     ("C-x f"   . counsel-find-file))
    :config
    (progn
    (ivy-set-display-transformer 'counsel-find-file 'my/ivy-mark-display-transformer)
    (setq counsel-find-file-ignore-regexp
        (concat
         ;; File names beginning with # or .
         "\\(?:\\`[#.]\\)"
         ;; File names ending with # or ~
         "\\|\\(?:\\`.+?[#~]\\'\\)"
         ;; File names ending in .pyc
         "\\|\\(?:\\`.+?\\.pyc\\'\\)"
         ))))

#+END_SRC
** Company
*** Custom company frontend
Since we want to display our company results in the minibuffer, we need to write
a custome company frontend
#+BEGIN_SRC emacs-lisp
(defun get-candidates-function (str pred _)
)
(defun insert-selection (s)
  (insert (s-chop-prefix company-prefix s))
)
(defun my/max-candidate-length (candidates)
  (--reduce-from (max acc (length it)) 15 candidates))

(defun my/format-candidate (s)
 (let ((msg (concat
              (format "[%s] " (or (get-text-property 0 :symbol s)"_"))
              (when company-prefix (propertize company-prefix 'face 'ivy-minibuffer-match-face-2))
              (s-pad-right (- (1+ (my/max-candidate-length company-candidates)) (length company-prefix))
                " "
                (s-chop-prefix company-prefix s))
              (let ((text (s-truncate 50 (get-text-property 0 :description s))))
              (when text (propertize text 'face 'minibuffer-prompt)))
              "\n")))
   (when (equal (nth company-selection company-candidates) s)
       (add-face-text-property 0 (length msg) 'highlight t msg)
   )
   msg))

(defun start-selection ()
  (message (mapconcat 'my/format-candidate company-candidates ""))
)

(defun hide-ivy ()
  (message "")
)
(defun counsel-company-frontend (command)
  (pcase command
    (`post-command (start-selection))
    (`hide (hide-ivy))))

#+END_SRC
*** Installation and configuration
Company is a general CODE completion engine (IVY) is a general completion candidate.
Ideally we would not need both.

#+BEGIN_SRC emacs-lisp
(use-package company
  :ensure t
  :commands (company-mode)
  :bind
  (:map company-active-map
    ("C-k" . company-select-previous)
    ("C-j" . company-select-next))
  :config
  (setq company-idle-delay .3)
  (setq company-minimum-prefix-length 2)
  (setq company-frontends
        '(company-preview-frontend counsel-company-frontend))
  (setq company-require-match 'never))

#+END_SRC
** IEdit
Iedit allows to edit multiple region of a same symbol
[[https://github.com/victorhge/iedit][Project homepage]]

#+BEGIN_SRC emacs-lisp
(use-package iedit
  :commands (iedit-mode)
  :ensure t)
#+END_SRC
* 3. Preferences
Various preferences configurations
** Visual preferences
UI Enhancements and preferences
*** Disable scrollbar
#+BEGIN_SRC emacs-lisp
(scroll-bar-mode -1)
#+END_SRC
*** Disable menubar
#+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
#+END_SRC
*** Disable toolbar
#+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
#+END_SRC
*** Disable splash screen
#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-screen t)
#+END_SRC
*** Line numbering
**** Relative line numbering
Linum relative allows us to see relative line numbers based on the current highlighted line
Setting linum-relative-current-symbol to empty string ensures that the current line number is written

#+BEGIN_SRC emacs-lisp :tangle yes
;; Linum relative mode configuration
(use-package linum-relative
   :ensure t
   :diminish linum-relative-mode
   :config
   (setq linum-relative-current-symbol "")
   (add-hook 'text-mode-hook 'linum-relative-mode) ;; global mode seems to enable it in the minibuffer
   (add-hook 'prog-mode-hook 'linum-relative-mode) ;; global mode seems to enable it in the minibuffer
   (add-hook 'text-mode-hook 'linum-mode)
   (add-hook 'prog-mode-mode-hook 'linum-mode))

#+END_SRC
**** Highlight line
We also want to highlight the current line by default

#+BEGIN_SRC emacs-lisp :tangle yes
;; Enable highlighting current line for all modes
(global-hl-line-mode 1)

#+END_SRC
*** Whitespace
Configure white-space mode. White-space mode allows you to visualize space char (line feeds, tab, spaces)
#+BEGIN_SRC emacs-lisp
(use-package whitespace
  :config
  (setq whitespace-style '(space-mark tab-mark newline-mark))
  (setq whitespace-display-mappings
        '((space-mark 32 [183] [46]) ; SPACE 32 「 」, 183 MIDDLE DOT 「·」, 46 FULL STOP 「.」
          (newline-mark 10 [182 10]) ; LINE FEED,
          (tab-mark 9 [8594 9] [92 9]) ; tab
          )))

#+END_SRC
*** Columns
Basically with columns, we want two things:
+ Show the column number in the power bar
+ Highlight the 80th columns for nice wrapping

#+BEGIN_SRC emacs-lisp
(setq-default fill-column 80)
(setq column-number-mode t)
(use-package fill-column-indicator
    :ensure t
    :commands (fci-mode)
    :config
    (setq fci-rule-width 3)
    (setq fci-rule-color "#A16946"))

#+END_SRC
*** Highlight number
Mode to highlight numbers in the actual buffer

[[https://github.com/Fanael/highlight-numbers][Project homepage]]

#+BEGIN_SRC emacs-lisp
;; Mode to highlight numbers
(use-package highlight-numbers
    :commands (highlight-numbers-mode)
    :ensure t)

#+END_SRC
*** Themes
**** Change custom theme directory
#+BEGIN_SRC emacs-lisp
(setq custom-theme-directory "~/.emacs.d/themes")
(setq custom-safe-themes t)
#+END_SRC
**** Load theme yesterday glow
#+BEGIN_SRC emacs-lisp
(load-theme 'yesterday-glow t)
#+END_SRC
** Window management preferences
Preferences and configurations linked to window management
*** Make minibuffer a separate frame
#+BEGIN_SRC emacs-lisp
  ;; Force initial frame to not have any minibuffer
  (setq initial-frame-alist '((name . "editor") (minibuffer . nil)))
  (add-to-list 'default-frame-alist '(minibuffer . nil))

  (defun endless/test ()
    (interactive)
    (let ((old (selected-frame)))
    (let* ((mf (make-frame '((minibuffer . only))))
           (mw (car (window-list mf t))))
      ;; (delete-frame (selected-frame) t)
      (setq default-minibuffer-frame mf)
      (make-frame '((minibuffer . nil))))
    (delete-frame old t)))

#+END_SRC
*** Make helps and messages into separate frame
This code ensures that the Help and Messages buffer are always shown on the same place

#+BEGIN_SRC emacs-lisp
(defun my/matchframe (frame)
  (when (equal "help" (frame-parameter frame 'name)) frame))
;; For help buffers
;; TODO: Shorten fn
(add-to-list 'display-buffer-alist
   '("^\\*[hH]elp.*$" .
       ((display-buffer-reuse-window display-buffer-use-some-frame display-buffer-pop-up-frame)
        . ((reusable-frames . t)
          (frame-predicate . my/matchframe)
          (pop-up-frame-parameters . ((name . "help")
                                      (minibuffer . nil)
                                      (unsplittable . t)))))))

;; For messages buffers
(add-to-list 'display-buffer-alist
   '("^\\*[Mm]essages.*$" .
       ((display-buffer-reuse-window display-buffer-use-some-frame display-buffer-pop-up-frame)
        . ((reusable-frames . t)
          (frame-predicate . my/matchframe)
          (pop-up-frame-parameters . ((name . "help")
                                      (minibuffer . nil)
                                      (unsplittable . t)))))))


(add-to-list 'display-buffer-alist
   '("^\\*[Mm]agit.*$" .
       ((display-buffer-reuse-window display-buffer-use-some-frame display-buffer-pop-up-frame)
        . ((reusable-frames . t)
          (frame-predicate . my/matchframe)
          (pop-up-frame-parameters . ((name . "help")
                                      (minibuffer . nil)
                                      (unsplittable . t)))))))

(add-to-list 'display-buffer-alist
   '("^\\*[Ff]lycheck.*$" .
       ((display-buffer-reuse-window display-buffer-use-some-frame display-buffer-pop-up-frame)
        . ((reusable-frames . t)
          (frame-predicate . my/matchframe)
          (pop-up-frame-parameters . ((name . "help")
                                      (minibuffer . nil)
                                      (unsplittable . t)))))))

#+END_SRC
** Change location of auto-saves
We wanna change the default location of temporary files to a temporary directory
#+BEGIN_SRC emacs-lisp

;; Change default location of temporary files
(setq backup-directory-alist
          `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms
          `((".*" ,temporary-file-directory t)))
#+END_SRC
** Change yes or no to y or n
#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p) ;; Yes or no questions become Y or n questions
#+END_SRC
** Trailing whitespace
Automatically remove trailing whitespace on save
#+BEGIN_SRC emacs-lisp
;; Remove trailing whitespaces before save
(add-hook 'before-save-hook 'delete-trailing-whitespace)

#+END_SRC
** Tabs
Describes how tabification work. Normally we want tabs to equal 4 spaces
and except on rare cases, tabs should be representend as spaces for
MANY reasons. Check the flame ware online

#+BEGIN_SRC emacs-lisp
(setq-default tab-width 4)
(setq-default indent-tabs-mode nil)

#+END_SRC
