init.org
*** Tab mode
Function to toggle tab-insertion mode instead of space-insertion
#+BEGIN_SRC emacs-lisp
(defun my/toggle-tab-mode ()
  "Toggle visual tab and whitespace mode"
  (interactive)
  (setq indent-tabs-mode (not indent-tabs-mode)))


#+END_SRC
** Scrolling
We want to ensure that emacs scrolls only one line at a time, else
it will jump page
#+BEGIN_SRC emacs-lisp
(setq scroll-step 1)

#+END_SRC
** Autoclosing buffers
I usually end up with lots of buffers floating around. So i took this script from:
[https://www.emacswiki.org/emacs/KillingBuffers#toc12]

It autocloses my saved buffers every hour (initially every 2 hours)
#+BEGIN_SRC emacs-lisp
;;; midnight mode

(require 'midnight)

;;kill buffers if they were last disabled more than this seconds ago
(setq clean-buffer-list-delay-special 900)

(defvar clean-buffer-list-timer nil
  "Stores clean-buffer-list timer if there is one. You can disable clean-buffer-list by (cancel-timer clean-buffer-list-timer).")

;; run clean-buffer-list every 2 hours
(setq clean-buffer-list-timer (run-at-time t 7200 'clean-buffer-list))

;; kill everything, clean-buffer-list is very intelligent at not killing
;; unsaved buffer.
(setq clean-buffer-list-kill-regexps '("^.*$"))

;; keep these buffer untouched
;; prevent append multiple times
(defvar clean-buffer-list-kill-never-buffer-names-init
  clean-buffer-list-kill-never-buffer-names
  "Init value for clean-buffer-list-kill-never-buffer-names")
(setq clean-buffer-list-kill-never-buffer-names
      (append
       '("*Messages*" "*cmd*" "*scratch*" "*w3m*" "*w3m-cache*" "*Inferior Octave*")
       clean-buffer-list-kill-never-buffer-names-init))

;; prevent append multiple times
(defvar clean-buffer-list-kill-never-regexps-init
  clean-buffer-list-kill-never-regexps
  "Init value for clean-buffer-list-kill-never-regexps")
;; append to *-init instead of itself
(setq clean-buffer-list-kill-never-regexps
      (append '("^\\*EMMS Playlist\\*.*$")
	      clean-buffer-list-kill-never-regexps-init))
#+END_SRC
** TODO Server mode
* 4. Help
In this section everything, we can find everything linked to globally
available help
** Which-key
This minor-mode allows us to list all the keybindings linked to a specific
key prefix. Damn useful with evil and for auto discovery.

We enable it globally.
#+BEGIN_SRC emacs-lisp
;; Configuration and installation of which-key
(use-package which-key
    :ensure t
    :diminish which-key-mode
    :config
    (which-key-setup-minibuffer)
    (which-key-mode 1))

#+END_SRC
** Search FN

#+BEGIN_SRC emacs-lisp
;; Configuration and installation of which-key
(defun counsel-custom-search-function (string base-cmd)
  "Grep in the current directory for STRING using BASE-CMD.
If non-nil, append EXTRA-AG-ARGS to BASE-CMD."
  (if (< (length string) 4)
      (counsel-more-chars 4)
    (let ((regex (counsel-unquote-regex-parens
                  (setq ivy--old-re
                        (ivy--regex string)))))
      (let* ((ag-cmd (format base-cmd string)))
        (counsel--async-command ag-cmd)
        nil))))

(defun counsel-custom-search (&optional initial-input)
  "Grep for a string in the current directory using ag."
  (interactive)
  (ivy-set-prompt 'counsel-custom-search counsel-prompt-function)
  (ivy-read "Search: "
            (lambda (string)
              (counsel-custom-search-function string "/home/ddugue/bin/search %s"))
            :initial-input initial-input
            :dynamic-collection t
            :keymap counsel-ag-map
            :history 'counsel-git-grep-history
            :action #'counsel-git-grep-action
            :unwind (lambda ()
                      (counsel-delete-process)
                      (swiper--cleanup))
            :caller 'counsel-custom-search))
#+END_SRC
* 5. Project management & git
In this section everything related to a project management or git tools.
Usually project get detected based on the root of the project which is where
the .git file is. That is why both categories are mixed up.

** Projectile
*** Installation
Projectile is a project management tool so you can browse
project files for instance

#+BEGIN_SRC emacs-lisp
;; Install projectile
(use-package projectile
  :ensure t
  :commands (projectile-mode projectile-project-p projectile-dired))

#+END_SRC
*** Counsel-projectile
Make use of package counsel-projectile to switch to project

#+BEGIN_SRC emacs-lisp
;; Install counsel-projectile
(use-package counsel-projectile
  :ensure t
  :commands (counsel-projectile-switch-project))
#+END_SRC
*** Shell command for project
Execute a shell command, spawns a comint window and make it mini mini!
#+BEGIN_SRC emacs-lisp
(defun my/executor-root (cmd)
  "Execute a command in the root directory of the project"
  (interactive "sCommand to execute:")
  (let (
(default-directory (when (projectile-project-p) (projectile-project-root)))
(shell-file-name "bash"))

    (my/executor cmd)))
#+END_SRC
*** Search ag on a project root
Add a function to search with ag with the root of the search
as the git repo root

#+BEGIN_SRC emacs-lisp
(defun my/git-ag (&optional initial-input)
  "Search with ag on the git root if possible"
  (interactive)
  (counsel-ag initial-input
    (when (projectile-project-p) (projectile-project-root))))

#+END_SRC
** Magit
Magit is the package to manage git repo
*** Installation
#+BEGIN_SRC emacs-lisp
(defun evil-magit/toggle (&optional intent)
  "Toggle the stage instead of moving it manually"
  (interactive "P")
  (pcase (magit-diff-type)
    ('unstaged (magit-stage intent))
    ('commited (magit-unstage))
    ('untracked (magit-stage intent))
    ('staged (magit-unstage))
    ('undefined (user-error "Cannot toggle"))))

(use-package magit
  :ensure t
  :commands (magit-status)
  :general
  (:states '(normal visual)
   :keymaps 'magit-status-mode-map
   "j" 'magit-section-forward
   "k" 'magit-section-backward
   "J" 'magit-section-forward-sibling
   "K" 'magit-section-backward-sibling
   "t" 'magit-section-forward
   "h" 'magit-section-backward
   "T" 'magit-section-forward-sibling
   "H" 'magit-section-backward-sibling
   "v" 'evil-magit/toggle
   "zz" 'magit-section-toggle
   "d" 'magit-discard
   )
  (:states '(normal visual)
   :keymaps 'magit-status-mode-map
   :prefix application-leader-key
   "m"  'magit-merge
   "c"  'magit-commit
   "a"  'magit-commit-amend
   "C"  'magit-commit-popup
   "P"  'magit-push-popup
   "pp" 'magit-push-current-to-upstream
   "F"  'magit-pull-popup
   "ff" 'magit-pull-from-upstream
   "bb" 'magit-checkout
   "bc" 'magit-branch-and-checkout
   "B"  'magit-branch-popup
   "r"  'magit-refresh
   "i"  'magit-gitignore
   )
  (:keymaps 'with-editor-mode-map
   "<C-return>" 'with-editor-finish)
   :config
   (evil-set-initial-state 'git-commit-mode 'normal)
   (evil-set-initial-state 'magit-mode 'normal)
   (evil-set-initial-state 'magit-status-mode 'normal)
   (setq magit-commit-show-diff nil))

#+END_SRC
*** TODO Add column mode for git commit message
** Smerge
Smerge is the mode to merge two files from git.
*** Configuration
#+BEGIN_SRC emacs-lisp
(use-package smerge-mode
   :ensure t
   :general
  (:states '(normal visual)
   :keymaps 'smerge-mode-map
   :prefix application-leader-key
   "RET" 'smerge-keep-current
   "SPC" 'smerge-keep-other
   "d"   'smerge-keep-base
   "a"   'smerge-keep-all
   "r"   'smerge-resolve
   "n"   'smerge-next
   "N"   'smerge-prev)
   :init
   (add-hook 'smerge-mode-hook #'evil-normalize-keymaps))
#+END_SRC
* 6. Error & Compilation
In this section, we have everything pertaining to syntax error highlighting and
compilations in general

** Overrides some functions of flycheck for a smaller display
#+BEGIN_SRC emacs-lisp
(defun my/override-flycheck-fn ()
(defconst flycheck-error-list-format
  `[("Line" 4 flycheck-error-list-entry-< :right-align t)
    ("ID" 15 t)
    (,(flycheck-error-list-make-last-column "Message" 'Checker) 0 t)]
  "Table format for the error list.")

(defun flycheck-error-list-make-entry (error)
  "Make a table cell for the given ERROR.

Return a list with the contents of the table cell."
  (let* ((level (flycheck-error-level error))
         (level-face (flycheck-error-level-error-list-face level))
         (line (flycheck-error-line error))
         (column (flycheck-error-column error))
         (message (or (flycheck-error-message error)
                      (format "Unknown %s" (symbol-name level))))
         (flushed-msg (flycheck-flush-multiline-message message))
         (id (flycheck-error-id error))
         (id-str (if id (format "%s" id) ""))
         (checker (flycheck-error-checker error))
         (msg-and-checker (flycheck-error-list-make-last-column flushed-msg checker))
         (explainer (flycheck-checker-get checker 'error-explainer)))
    (list error
          (vector (flycheck-error-list-make-number-cell
                   line level-face)
                  ;; Error ID use a different face when an error-explainer is present
                  (flycheck-error-list-make-cell
                   id-str (if explainer 'flycheck-error-list-id-with-explainer
                            'flycheck-error-list-id)
                   id-str 'flycheck-error-list-explain-error)
                  (flycheck-error-list-make-cell
                   msg-and-checker nil msg-and-checker))))))
#+END_SRC
