init.el
(use-package flycheck
  :commands (flycheck-mode flycheck-add-mode)
  :ensure t
  :init
    (setq-default flycheck-disabled-checkers '(python-flake8 javascript-jshint))
  :bind
    (:map flycheck-error-list-mode-map
             ("j" . flycheck-error-list-next-error)
             ("k" . flycheck-error-list-previous-error))
  :config
    (my/override-flycheck-fn)
    (setq flycheck-check-syntax-automatically '(save new-line idle-change mode-enabled))
    (setq flycheck-display-errors-delay 30)
  )

;; TODO: Make this a toggle
(defun my/enable-flycheck ()
  (interactive)
  (flycheck-mode t)
  (flycheck-list-errors))
(use-package yasnippet
  :commands (yas-minor-mode yas-new-snippet)
  :ensure t
  :config
  (yas-reload-all)
  ;; We disable the default tab keyboard shortcut
  (define-key yas-minor-mode-map (kbd "<tab>") nil)
  (define-key yas-minor-mode-map (kbd "TAB") nil)
  :general
  (:keymaps 'snippet-mode-map
    "<C-return>" 'yas-load-snippet-buffer-and-close)
)
(use-package ya-chain
  :commands (ya-chain-mode)
  :bind
  (:map ya-chain-mode-map
    ("<S-return>" . chain-insert-template))
)
    (defun my/touch-file (filename)
      "Create a file into the current directory"
      (interactive "sName of the file:")
      (shell-command (concat "touch " (shell-quote-argument filename)))
      (revert-buffer)
    )

    (defun my/dired-toggle-mark ()
      "Toggle a mark"
      (interactive)
      (save-restriction
        (narrow-to-region (point-at-bol) (point-at-eol))
        (dired-toggle-marks))
    )

    (defun my/wdired-commit ()
      "Commit edits and come back in wdired mode"
      (interactive)
      (wdired-finish-edit)
      (revert-buffer)
      (wdired-change-to-wdired-mode)
      (evil-normal-state)
    )

    (defun my/enter-wdired-and-change ()
      (interactive)
      (wdired-change-to-wdired-mode)
      (evil-normal-state))


    (defun my/enter-wdired-and-delete ()
      (interactive)
      (wdired-change-to-wdired-mode)
      (evil-normal-state)
      (evil-delete))

    (defun my/dired-do-delete ()
      (interactive)
      (dired-do-delete)
      (revert-buffer))

    (defun my/setup-dired (fun &rest args)
       (message "Dired started")
       (let ((res (apply fun args)))
          (message "Dired stopped")
           res))

    (use-package dired-ranger
      :ensure t
      :commands (dired-ranger-move dired-ranger-paste dired-ranger-copy))

    (use-package wdired
      :ensure t)
    (use-package dired
      :commands (dired)
      :bind
      (:map dired-mode-map
       ("SPC" . nil))
      :general
      (:states '(normal visual)
       :keymaps 'wdired-mode-map
       "<C-return>" 'my/wdired-commit
       "<return>" 'dired-find-file)
      (:states '(normal visual)
       :keymaps '(dired-mode-map wdired-mode-map)
       "m" 'my/dired-toggle-mark
       "dd" 'my/dired-do-delete
       "zz" 'dired-maybe-insert-subdir
       "y" 'dired-ranger-copy
       "p" 'dired-ranger-paste
      )
      (:states '(normal visual)
       :keymaps '(dired-mode-map wdired-mode-map)
       :prefix application-leader-key
       "!"  'dired-do-shell-command
       "i"  'dired-create-directory
       "a"  'my/touch-file
       "m" 'dired-ranger-move
       "%" 'dired-mark-files-regexp)
      :config
      (add-hook 'dired-after-readin-hook
                (lambda ()
                        (unless (member 'wdired-mode (mapcar #'car minor-mode-alist))
                                (my/enter-wdired-and-change)
                         ))))
(use-package ledger-mode
  :mode ("\\.dat\\'" . ledger-mode)
  :ensure t
  :general
  (:states '(normal visual)
   :prefix application-leader-key
   :keymaps 'ledger-mode-map
     "=" 'ledger-mode-clean-buffer
   )
)
(setq org-hide-leading-stars t) ;; Ensure that we hide the number of stars before the first one
(setq org-startup-indented t) ;; Ensure we indent all the content
(use-package org
    :config
    (use-package org-bullets
        :ensure t
        :config
        (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
)
;; Ensure syntax of the language is used inside source blocks
(setq org-src-fontify-natively t)

;; Ensure tabs work properly inside source blocks
(setq org-src-tab-acts-natively t)
(use-package org
   :general
   (:states '(insert normal visual)
    :keymaps 'org-mode-map
    "M-h" 'org-metaleft
    "M-l" 'org-metaright)
   (:states '(normal visual)
    :keymaps 'org-mode-map
    :prefix application-leader-key
    "l" 'org-toggle-latex-fragment)
   :init
   (setq org-preview-latex-default-process 'dvipng))
(use-package org-drill
  :ensure org-plus-contrib
  :commands (org-drill-directory))
   ;; (defun my/executor (cmd)
   ;;   "Execute a command in a subshell"
   ;;   (interactive "sCommand to execute:")
   ;;   (save-selected-window
   ;;     (let ((frame (make-frame))
   ;;           (buffer (generate-new-buffer "*commands*")))
   ;;          (with-current-buffer buffer
   ;;             ;; (display-buffer buffer '((display-buffer-reuse-window)) frame)
   ;;             (comint-mode))))
   ;;   (select-frame (window-frame (get-buffer-window))))

        ;; (let ((process
        ;;         (start-file-process-shell-command
        ;;         "sub-process"
        ;;         buffer
        ;;         cmd)))
        ;;     (set-process-sentinel process
        ;;         (lambda (process event)
        ;;             (message event))))))
  ;; (set-process-filter process 'ansi-color-process-output)
       ;; (if (equal event "open\n")
       ;;   (when (get-buffer buf) (display-buffer buf t))
       ;; (when (= 0 (process-exit-status process))
       ;;   (let ((buf (process-buffer process)))
       ;;     (when (get-buffer buf)
       ;;       (display-buffer buf t)
       ;;       (run-at-time "5 sec" nil (lambda (buffer)
       ;;       (when (get-buffer buffer)
       ;;       (delete-frame (window-frame (get-buffer-window buffer)))
       ;;       (kill-buffer buffer))) buf)
       ;;       )))))))
(defun my/shell-open ()
  "Open a shell in root of project"
  (interactive)
   (let ((project-root (if (projectile-project-p) (projectile-project-root) "~")))
         (progn
           (message project-root)
           (eshell (generate-new-buffer-name "*eshell*"))
           (eshell-kill-input)
           (insert (concat "cd " project-root))
           (eshell-send-input)
           (end-of-buffer)
           )))
;; Make ansi-term lazy-load
(use-package shell
    :commands (shell)
    :bind (:map shell-mode-map
    ([tab] . counsel-company))
    :init (evil-set-initial-state 'shell 'emacs)
)

;; For help buffers
(add-to-list 'display-buffer-alist
   '("^\\*[Ee]shell.*$" .
       ((display-buffer-pop-up-frame)
        . ((pop-up-frame-parameters . ((name . "shell-terminal")
                                      (minibuffer . nil)
                                     )
          ))
       )
    )
)
