init.org
*** Ansi colors
Add ansi colors to comint shell outputs!
#+BEGIN_SRC emacs-lisp
(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
(add-to-list 'comint-output-filter-functions 'ansi-color-process-output)
#+END_SRC
** EWW (Web browsing)
Installs and configures EWW for web browsing
#+BEGIN_SRC emacs-lisp
(defvar-local endless/display-images t)

(defun endless/toggle-image-display ()
  "Toggle images display on current buffer."
  (interactive)
  (setq endless/display-images
        (null endless/display-images))
  (endless/backup-display-property endless/display-images))

(defun endless/backup-display-property (invert &optional object)
  "Move the 'display property at POS to 'display-backup.
Only applies if display property is an image.
If INVERT is non-nil, move from 'display-backup to 'display
instead.
Optional OBJECT specifies the string or buffer. Nil means current
buffer."
  (let* ((inhibit-read-only t)
         (from (if invert 'display-backup 'display))
         (to (if invert 'display 'display-backup))
         (pos (point-min))
         left prop)
    (while (and pos (/= pos (point-max)))
      (if (get-text-property pos from object)
          (setq left pos)
        (setq left (next-single-property-change pos from object)))
      (if (or (null left) (= left (point-max)))
          (setq pos nil)
        (setq prop (get-text-property left from object))
        (setq pos (or (next-single-property-change left from object)
                      (point-max)))
        (when (eq (car prop) 'image)
          (add-text-properties left pos (list from nil to prop) object))))))

(use-package eww-lnum
  :ensure t)

(use-package eww
  :general
  (:keymaps 'eww-mode-map
   :prefix application-leader-key
           "r" 'eww-reload
           "<return>" 'eww-browse-with-external-browser
           "z" 'eww-readable
           "ti" 'endless/toggle-image-display
           "v" 'eww-view-source
           "g" 'eww
           "y" 'eww-copy-page-url
           "b" 'eww-add-bookmark)
  (:keymaps 'eww-mode-map
   :states '(normal)
   "<C-return>" 'eww-submit
   "f" 'eww-lnum-follow
   ";" 'eww-lnum-universal
   "b" 'eww-back-url
   "J" 'evil-scroll-down
   "K" 'evil-scroll-up
   "T" 'evil-scroll-down
   "H" 'evil-scroll-up
  )
  :config
  (setq shr-color-visible-luminance-min 90)
  (setq eww-search-prefix "https://www.google.com/search?q="))

#+END_SRC
** Files
Functions and tools to deal with files
*** Sudo open
Allow to reopen current file as sudo via TRAMP
#+BEGIN_SRC emacs-lisp
;; from magnars
(defun spacemacs/sudo-edit (&optional arg)
  "Open file in sudo mode"
  (interactive "p")
  (let ((fname (if (or arg (not buffer-file-name))
                   (read-file-name "File: ")
                 buffer-file-name)))
    (find-file
     (cond ((string-match-p "^/ssh:" fname)
            (with-temp-buffer
              (insert fname)
              (search-backward ":")
              (let ((last-match-end nil)
                    (last-ssh-hostname nil))
                (while (string-match "@\\\([^:|]+\\\)" fname last-match-end)
                  (setq last-ssh-hostname (or (match-string 1 fname)
                                              last-ssh-hostname))
                  (setq last-match-end (match-end 0)))
                (insert (format "|sudo:%s" (or last-ssh-hostname "localhost"))))
              (buffer-string)))
           (t (concat "/sudo:root@localhost:" fname))))))

#+END_SRC
** Bookmarking
Functions and tools to deal with emacs bookmarking
*** Default bookmark
Adds a function to go to a default bookmark (m) in this case

#+BEGIN_SRC emacs-lisp
(defun my/goto-default-mark ()
  "Go to the bookmark 'm'"
  (interactive)
  (evil-goto-mark ?m))

#+END_SRC
** Buffers
Functions and tools for buffer management
*** Make minibuffer frame
Elisp function to spawn a new minibuffer frame
#+BEGIN_SRC emacs-lisp
(defun my/open-up-minibuffer ()
"Open a new minibuffer frame"
(interactive)
(let ((my-minibuffer-window
        (frame-selected-window (make-frame '((minibuffer . t))))))
  (message my-minibuffer-window)
  (set-minibuffer-window my-minibuffer-window)
))

#+END_SRC
*** Kill all buffers
Elisp function to kill all other opened buffers

#+BEGIN_SRC emacs-lisp
(defun my/kill-other-buffers ()
  "Kill all other buffers"
  (interactive)
  (mapc 'kill-buffer (delq (current-buffer) (buffer-list))))

#+END_SRC
*** Switch to last buffer
Easy switch to last opened buffer

#+BEGIN_SRC emacs-lisp
(defun spacemacs/alternate-buffer (&optional window)
  "Switch back and forth between current and last buffer in the
current window."
  (interactive)
  (let ((current-buffer (window-buffer window))
        (buffer-predicate
         (frame-parameter (window-frame window) 'buffer-predicate)))
    ;; switch to first buffer previously shown in this window that matches
    ;; frame-parameter `buffer-predicate'
    (switch-to-buffer
     (or (cl-find-if (lambda (buffer)
                       (and (not (eq buffer current-buffer))
                            (or (null buffer-predicate)
                                (funcall buffer-predicate buffer))))
                     (mapcar #'car (window-prev-buffers window)))
         ;; `other-buffer' honors `buffer-predicate' so no need to filter
         (other-buffer current-buffer t)))))

#+END_SRC
** Emacs itself
Tools and functions to work with emacs itself (so meta)
*** Reload configs
We first define a function to restart emacs cleanly
#+BEGIN_SRC emacs-lisp
;; Function to reload editor
(defun my/reload-emacs ()
    "Reload emacs config"
    (interactive)
    (load-file "~/.emacs.d/init.el"))

#+END_SRC
*** Open config file
Simple command to open this org file quickly

#+BEGIN_SRC emacs-lisp
;; Function to open this config file
(defun my/open-config ()
    "Open emacs config"
    (interactive)
    (find-file "~/.emacs.d/init.org"))

#+END_SRC
** Calc
Calculator for quick computation (uses RPN notation in calc-mode)

#+BEGIN_SRC emacs-lisp
(use-package calculator
   :commands (calculator)
   :init
      (add-to-list 'evil-emacs-state-modes 'calculator-mode)
      (evil-set-initial-state 'calculator-mode 'emacs)

)
#+END_SRC
** Diff mode
Diff mode allows you to compare two files and apply the differences
between them

#+BEGIN_SRC emacs-lisp
(use-package diff
  :general
  (:states '(normal visual)
   :keymaps 'diff-mode-map
   :prefix application-leader-key
   "n" 'diff-hunk-next
   "<return>" 'diff-apply-hunk
   )
  )
#+END_SRC



* 8. Programming languages & environment
In this section we regrouped the different programming languages environment and
their corresponding tools.

** Python
*** Python mode
TODO: Cleanup
#+BEGIN_SRC emacs-lisp
(defun my/set-venv ()
  (interactive)
  (require 'projectile)
  (when (projectile-project-p)
    (progn
      (venv-set-location (projectile-project-root))
      (setq python-environment-directory venv-location)
      (venv-workon "venv")
      (setenv "PYTHONPATH" (concat
                             (getenv "PYTHONPATH")
                              ":"
                             (concat (projectile-project-root) "src/")))
)))

(use-package company-jedi
  :ensure t)

(use-package virtualenvwrapper
  :ensure t
  :commands (venv-set-location venv-workon)
  :config
  (add-hook 'venv-postactivate-hook
            (lambda () (progn
                         (shell-command "pip install nose pylint pylint-django")
                         (jedi:install-server)
                         (flycheck-disable-checker 'python-pylint t)))))
;; When we jedi pop marker, we should close the buffer for SPC TAB
(use-package python
  :mode ("\\.py\\'" . python-mode)
  :interpreter ("python" . python-mode)
  :general
  (:keymaps 'python-mode-map
   :states '(normal)
   "g." 'jedi:goto-definition
   "g," 'jedi:goto-definition-pop-marker)
  :config
   (general-define-key
    :states '(normal)
    :keymaps 'python-mode-map
    :prefix application-leader-key
    "vv" 'my/set-venv)
   (add-hook 'python-mode-hook
     (lambda ()
       (progn
         (set (make-local-variable 'company-backends) '(company-jedi))
         (company-mode t)
         (flycheck-mode t)
         (highlight-numbers-mode t)
         ))))

#+END_SRC
** Html
