init.el
(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
(add-to-list 'comint-output-filter-functions 'ansi-color-process-output)
(defvar-local endless/display-images t)

(defun endless/toggle-image-display ()
  "Toggle images display on current buffer."
  (interactive)
  (setq endless/display-images
        (null endless/display-images))
  (endless/backup-display-property endless/display-images))

(defun endless/backup-display-property (invert &optional object)
  "Move the 'display property at POS to 'display-backup.
Only applies if display property is an image.
If INVERT is non-nil, move from 'display-backup to 'display
instead.
Optional OBJECT specifies the string or buffer. Nil means current
buffer."
  (let* ((inhibit-read-only t)
         (from (if invert 'display-backup 'display))
         (to (if invert 'display 'display-backup))
         (pos (point-min))
         left prop)
    (while (and pos (/= pos (point-max)))
      (if (get-text-property pos from object)
          (setq left pos)
        (setq left (next-single-property-change pos from object)))
      (if (or (null left) (= left (point-max)))
          (setq pos nil)
        (setq prop (get-text-property left from object))
        (setq pos (or (next-single-property-change left from object)
                      (point-max)))
        (when (eq (car prop) 'image)
          (add-text-properties left pos (list from nil to prop) object))))))

(use-package eww-lnum
  :ensure t)

(use-package eww
  :general
  (:keymaps 'eww-mode-map
   :prefix application-leader-key
           "r" 'eww-reload
           "<return>" 'eww-browse-with-external-browser
           "z" 'eww-readable
           "ti" 'endless/toggle-image-display
           "v" 'eww-view-source
           "g" 'eww
           "y" 'eww-copy-page-url
           "b" 'eww-add-bookmark)
  (:keymaps 'eww-mode-map
   :states '(normal)
   "<C-return>" 'eww-submit
   "f" 'eww-lnum-follow
   ";" 'eww-lnum-universal
   "b" 'eww-back-url
   "J" 'evil-scroll-down
   "K" 'evil-scroll-up
  )
  :config
  (setq shr-color-visible-luminance-min 90)
  (setq eww-search-prefix "https://www.google.com/search?q="))

;; from magnars
(defun spacemacs/sudo-edit (&optional arg)
  "Open file in sudo mode"
  (interactive "p")
  (let ((fname (if (or arg (not buffer-file-name))
                   (read-file-name "File: ")
                 buffer-file-name)))
    (find-file
     (cond ((string-match-p "^/ssh:" fname)
            (with-temp-buffer
              (insert fname)
              (search-backward ":")
              (let ((last-match-end nil)
                    (last-ssh-hostname nil))
                (while (string-match "@\\\([^:|]+\\\)" fname last-match-end)
                  (setq last-ssh-hostname (or (match-string 1 fname)
                                              last-ssh-hostname))
                  (setq last-match-end (match-end 0)))
                (insert (format "|sudo:%s" (or last-ssh-hostname "localhost"))))
              (buffer-string)))
           (t (concat "/sudo:root@localhost:" fname))))))

(defun my/goto-default-mark ()
  "Go to the bookmark 'm'"
  (interactive)
  (evil-goto-mark ?m))

(defun my/open-up-minibuffer ()
"Open a new minibuffer frame"
(interactive)
(let ((my-minibuffer-window
        (frame-selected-window (make-frame '((minibuffer . t))))))
  (message my-minibuffer-window)
  (set-minibuffer-window my-minibuffer-window)
))

(defun my/kill-other-buffers ()
  "Kill all other buffers"
  (interactive)
  (mapc 'kill-buffer (delq (current-buffer) (buffer-list))))

(defun spacemacs/alternate-buffer (&optional window)
  "Switch back and forth between current and last buffer in the
current window."
  (interactive)
  (let ((current-buffer (window-buffer window))
        (buffer-predicate
         (frame-parameter (window-frame window) 'buffer-predicate)))
    ;; switch to first buffer previously shown in this window that matches
    ;; frame-parameter `buffer-predicate'
    (switch-to-buffer
     (or (cl-find-if (lambda (buffer)
                       (and (not (eq buffer current-buffer))
                            (or (null buffer-predicate)
                                (funcall buffer-predicate buffer))))
                     (mapcar #'car (window-prev-buffers window)))
         ;; `other-buffer' honors `buffer-predicate' so no need to filter
         (other-buffer current-buffer t)))))

;; Function to reload editor
(defun my/reload-emacs ()
    "Reload emacs config"
    (interactive)
    (load-file "~/.emacs.d/init.el"))

;; Function to open this config file
(defun my/open-config ()
    "Open emacs config"
    (interactive)
    (find-file "~/.emacs.d/init.org"))

(use-package calculator
   :commands (calculator)
   :init
      (add-to-list 'evil-emacs-state-modes 'calculator-mode)
      (evil-set-initial-state 'calculator-mode 'emacs)

)
(defun my/set-venv ()
  (interactive)
  (require 'projectile)
  (when (projectile-project-p)
    (progn
      (venv-set-location (projectile-project-root))
      (setq python-environment-directory venv-location)
      (venv-workon "venv")
      (setenv "PYTHONPATH" (concat
                             (getenv "PYTHONPATH")
                              ":"
                             (concat (projectile-project-root) "src/")))
)))

(use-package company-jedi
  :ensure t)

(use-package virtualenvwrapper
  :ensure t
  :commands (venv-set-location venv-workon)
  :config
  (add-hook 'venv-postactivate-hook
            (lambda () (progn
                         (shell-command "pip install nose pylint pylint-django")
                         (jedi:install-server)
                         (flycheck-disable-checker 'python-pylint t)))))
;; When we jedi pop marker, we should close the buffer for SPC TAB
(use-package python
  :mode ("\\.py\\'" . python-mode)
  :interpreter ("python" . python-mode)
  :general
  (:keymaps 'python-mode-map
   :states '(normal)
   "g." 'jedi:goto-definition
   "g," 'jedi:goto-definition-pop-marker)
  :config
   (general-define-key
    :states '(normal)
    :keymaps 'python-mode-map
    :prefix application-leader-key
    "vv" 'my/set-venv)
   (add-hook 'python-mode-hook
     (lambda ()
       (progn
         (set (make-local-variable 'company-backends) '(company-jedi))
         (company-mode t)
         (flycheck-mode t)
         (highlight-numbers-mode t)
         ))))
