init.el

(use-package web-mode
  :mode (("\\.html?\\'" . web-mode)
         ("\\.jsx\\'"   . web-mode))
  :ensure t
  :config
  (setq web-mode-content-types-alist
    '(("jsx" . "\\.js[x]?\\'")))
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-code-indent-offset 2)
  (setq web-mode-enable-current-column-highlight t)
  (setq web-mode-engines-alist
    '(("django" . "\\.html\\'")))
  (add-hook 'web-mode-hook 'turn-off-fci-mode)
  (add-hook 'web-mode-hook
    (lambda ()
      (if (equal web-mode-content-type "jsx") (progn
         (flycheck-add-mode 'javascript-eslint 'web-mode)
         (message "JSX loaded")
         (set (make-local-variable 'company-backends) '(company-tern))
         (tern-mode t)
         (company-mode t)
         (flycheck-mode t)
         (highlight-numbers-mode t)
         ))))
  :general
  (:keymaps 'web-mode-map
   :states '(normal)
   "zz" 'web-mode-fold-or-unfold)
  (:keymaps 'web-mode-map
   :states '(normal)
   :prefix application-leader-key
   "=" 'web-mode-buffer-indent))
(use-package js2-mode
  :ensure t
  :mode ("\\.js\\'" . js2-mode)
  :config
  (add-to-list 'company-backends 'company-tern)

  (setq js2-mode-show-parse-errors nil)
  (setq js2-mode-show-strict-warnings nil)
  (setq js2-basic-offset 2)
  (add-hook 'js2-mode-hook
    (lambda ()
      (progn
         (set (make-local-variable 'company-backends) '(company-tern))
         (tern-mode t)
         (company-mode t)
         (flycheck-mode t)
         (highlight-numbers-mode t)
         ))))

(use-package tern
  :ensure t
  :commands (tern-mode)
)

(use-package company-tern
  :ensure t
  :commands (company-tern)
)

(defun my/eslint-format ()
  (interactive)
  (save-excursion
    (let ((cmd (if (projectile-project-p)
           (concat (projectile-project-root) "node_modules/eslint/bin/eslint.js")
           (if (executable-find "eslint") "eslint" (user-error "No eslint on the system"))
           )))
      (save-buffer)
      (call-process cmd nil "*ESLint Errors*" nil "--fix" buffer-file-name)
      (revert-buffer t t)
)))
(require 'dash)
(require 's)
(defun my/react-eval-props (props)
  (s-join "\n" (-keep
    (lambda (line)
            (unless (s-contains? "isRequired" line)
              (when (s-contains? ":" line)
                (s-concat (s-left (1+ (s-index-of ":" line)) line) "'',"))))
  (split-string props "\n"))))
(use-package conf-mode
  :mode "\\.pylintrc\\'")
(use-package android-mode
  :ensure t
  :commands (android-mode))
(use-package julia-mode
  :mode ("\\.jl\\'" . julia-mode)
  :ensure t)

(use-package yaml-mode
  :ensure t
  :mode ("\\.yml\\'" . yaml-mode)
  :config
  (add-hook 'yaml-mode-hook
    (lambda ()
      (progn (highlight-numbers-mode)
      (face-remap-add-relative 'font-lock-variable-name-face '(:foreground "#E7C547"))
      (face-remap-add-relative 'default '(:foreground "#FF8100"))))))
(use-package haskell-mode
  :ensure t
  :mode ("\\.hs\\'" . haskell-mode))
(global-unset-key (kbd "C-SPC"))

;; leader key prefix shortcuts
(general-define-key
  :prefix default-leader-key
  ;; Help
  "h"  '(:ignore t :which-key "Help")
  "hf" 'counsel-describe-function
  "hv" 'counsel-describe-variable
  "hh" 'counsel-describe-function
  "hk" 'describe-key

  ;; Project
  "g"  '(:ignore t :which-key "Projects")
  "gg" 'magit-status
  "/"  'my/git-ag

  ;; Refactoring / Replace
  "r"  'iedit-mode

  ;; Buffers
  "b"  '(:ignore t :which-key "Buffers")
  "bb" 'ivy-switch-buffer
  "bd" 'evil-delete-buffer
  "bc" 'my/kill-other-buffers
  "br" 'revert-buffer
  "TAB" 'spacemacs/alternate-buffer

  ;; Files
  "f"  '(:ignore t :which-key "Files")
  "ff" 'counsel-find-file
  "fl" 'counsel-locate
  "f!" 'spacemacs/sudo-edit
  "fs" 'save-buffer

  ;; Editor
  "E"  '(:ignore t :which-key "Editor")
  "Er" 'my/reload-emacs
  "Ef" 'my/open-config

  ;; Windows
  "w"  '(:ignore t :which-key "Windows")
  "wd" 'delete-other-windows
  "wc" 'delete-other-windows
  "wa" 'make-frame-command
  "wb" 'my/open-up-minibuffer

  ;; Error management
  "e"  '(:ignore t :which-key "Errors")
  "ee" 'my/enable-flycheck

  ;; Toggles
  "t"  '(:ignore t :which-key "Toggles")
  "tn" 'highlight-numbers-mode
  "te" 'flycheck-mode
  "tw" 'whitespace-mode
  "ta" 'my/toggle-tab-mode
  "tA" 'android-mode

  ;; Applications
  "RET" 'my/shell-open
  "a"  '(:ignore t :which-key "Applications")
  "aw" 'eww
  "ac" 'calculator
  "ad" 'dired-jump
  "ay" 'yas-new-snippet

  ;; Inserts
  "i" '(:ignore t :which-key "Inserts")
  "ic" 'insert-char
)


(general-define-key
  ";" 'evil-commentary
  "/" 'swiper
  "é" 'swiper)

(general-define-key "`"
  (general-key-dispatch 'evil-goto-mark
    "`" 'my/goto-default-mark
  ))

(general-define-key
  :keymaps '(evil-normal-state-map evil-motion-state-map)
  ;; Folding
  "za" 'evil-close-folds
  "zz" 'evil-toggle-fold)

(add-hook 'prog-mode-hook 'fci-mode)
(add-hook 'prog-mode-hook 'ya-chain-mode)
(add-hook 'prog-mode-hook 'yas-minor-mode)
